Clash Bot Webapp Workspace - Plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ClashBot/ClashBot-Webapp/runs/run-mXZFZV1W35XVip1H

Waiting for the plan to start...

Terraform v1.2.6
on linux_amd64
Initializing plugins and modules...
data.tfe_outputs.clash-bot-discord-bot: Reading...
data.tfe_outputs.clash-bot-discord-bot: Read complete after 0s [id=ClashBot-ClashBot]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=816923827429]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.clash-bot-webapp-task-logs will be created
  + resource "aws_cloudwatch_log_group" "clash-bot-webapp-task-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "clash-bot-webapp-ecs-task-logs"
      + retention_in_days = 120
      + tags_all          = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_cloudwatch_log_group.clash-bot-ws-task-logs will be created
  + resource "aws_cloudwatch_log_group" "clash-bot-ws-task-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "clash-bot-webapp-ws-ecs-task-logs"
      + retention_in_days = 120
      + tags_all          = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_dynamodb_table.clash-bot-association-table will be created
  + resource "aws_dynamodb_table" "clash-bot-association-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "playerId"
      + id               = (known after apply)
      + name             = (sensitive)
      + range_key        = "association"
      + read_capacity    = 10
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
      + write_capacity   = 1

      + attribute {
          + name = "association"
          + type = "S"
        }
      + attribute {
          + name = "playerId"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_dynamodb_table.clash-bot-teams-table will be created
  + resource "aws_dynamodb_table" "clash-bot-teams-table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "serverName"
      + id               = (known after apply)
      + name             = (sensitive)
      + range_key        = "details"
      + read_capacity    = 10
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
      + write_capacity   = 1

      + attribute {
          + name = "details"
          + type = "S"
        }
      + attribute {
          + name = "serverName"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # aws_ecs_service.clash-bot-webapp-service will be created
  + resource "aws_ecs_service" "clash-bot-webapp-service" {
      + cluster                            = (sensitive)
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "clash-bot-webapp-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "clash-bot-webapp-ecs-service"
        }
      + tags_all                           = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-ecs-service"
          + "Type"        = "Webapp"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "clash-bot-webapp-service"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (sensitive)
        }
    }

  # aws_ecs_service.clash-bot-ws-service will be created
  + resource "aws_ecs_service" "clash-bot-ws-service" {
      + cluster                            = (sensitive)
      + deployment_maximum_percent         = 100
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "clash-bot-webapp-ws-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "clash-bot-webapp-ws-ecs-service"
        }
      + tags_all                           = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-ws-ecs-service"
          + "Type"        = "Webapp"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "clash-bot-webapp-ws"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (sensitive)
        }
    }

  # aws_ecs_task_definition.clash-bot-webapp-task-def will be created
  + resource "aws_ecs_task_definition" "clash-bot-webapp-task-def" {
      + arn                      = (known after apply)
      + container_definitions    = (sensitive)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "clash-bot-webapp-service"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"    = "clash-bot-webapp-task"
          + "Release" = "PR Build"
        }
      + tags_all                 = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-task"
          + "Release"     = "PR Build"
          + "Type"        = "Webapp"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_ecs_task_definition.clash-bot-ws-service-task-def will be created
  + resource "aws_ecs_task_definition" "clash-bot-ws-service-task-def" {
      + arn                      = (known after apply)
      + container_definitions    = (sensitive)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "clash-bot-webapp-ws"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"    = "clash-bot-webapp-task"
          + "Release" = "PR Build"
        }
      + tags_all                 = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-task"
          + "Release"     = "PR Build"
          + "Type"        = "Webapp"
        }
    }

  # aws_iam_policy.webapp_dynamodb_iam_policy will be created
  + resource "aws_iam_policy" "webapp_dynamodb_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-dynamodb-ecs-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_iam_policy.webapp_ecr_iam_policy will be created
  + resource "aws_iam_policy" "webapp_ecr_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-webapp-ecr-ecs-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_iam_policy.webapp_ecr_registry_iam_policy will be created
  + resource "aws_iam_policy" "webapp_ecr_registry_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-webapp-ecr-ecs-registry-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_iam_policy.webapp_logs_iam_policy will be created
  + resource "aws_iam_policy" "webapp_logs_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-webapp-ecs-logs-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_iam_policy.ws_ecr_registry_iam_policy will be created
  + resource "aws_iam_policy" "ws_ecr_registry_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-ws-ecr-ecs-registry-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_iam_policy.ws_logs_iam_policy will be created
  + resource "aws_iam_policy" "ws_logs_iam_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clash-bot-ws-ecs-logs-policy"
      + path      = "/"
      + policy    = (sensitive)
      + policy_id = (known after apply)
      + tags_all  = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
    }

  # aws_iam_role.clash-bot-webapp-exec-role will be created
  + resource "aws_iam_role" "clash-bot-webapp-exec-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash-bot-webapp-webapp-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.clash-bot-webapp-task-role will be created
  + resource "aws_iam_role" "clash-bot-webapp-task-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash-bot-webapp-webapp-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.clash-bot-ws-exec-role will be created
  + resource "aws_iam_role" "clash-bot-ws-exec-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "clash-bot-webapp-ws-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs-dynamodb-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-dynamodb-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-webapp-webapp-task-role"
    }

  # aws_iam_role_policy_attachment.ecs-ecr-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-ecr-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-webapp-webapp-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-ecr-repository-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-ecr-repository-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-webapp-webapp-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-ecr-ws-repository-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-ecr-ws-repository-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-webapp-ws-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-logs-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-logs-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-webapp-webapp-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-ws-ecr-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-ws-ecr-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-webapp-ws-exec-role"
    }

  # aws_iam_role_policy_attachment.ecs-ws-logs-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-ws-logs-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "clash-bot-webapp-ws-exec-role"
    }

  # aws_lb.clash-bot-webapp-lb will be created
  + resource "aws_lb" "clash-bot-webapp-lb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "clash-bot-webapp-lb"
      + security_groups            = (known after apply)
      + subnets                    = (sensitive)
      + tags                       = {
          + "Name" = "clash-bot-webapp-lb"
        }
      + tags_all                   = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-lb"
          + "Type"        = "Webapp"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.clash-bot-webapp-lb-listener will be created
  + resource "aws_lb_listener" "clash-bot-webapp-lb-listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Not Found."
              + status_code  = "404"
            }
        }
    }

  # aws_lb_listener_rule.webapp_safe_traffic will be created
  + resource "aws_lb_listener_rule" "webapp_safe_traffic" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/api/*",
                ]
            }
        }
    }

  # aws_lb_listener_rule.ws_safe_traffic will be created
  + resource "aws_lb_listener_rule" "ws_safe_traffic" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 101
      + tags_all     = {
          + "Application" = "Clash-Bot-Webapp"
          + "Type"        = "Webapp"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/ws/*",
                ]
            }
        }
    }

  # aws_lb_target_group.clash-bot-webapp-tg will be created
  + resource "aws_lb_target_group" "clash-bot-webapp-tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "clash-bot-webapp-webapp-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "clash-bot-webapp-ecs-tg"
        }
      + tags_all                           = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-ecs-tg"
          + "Type"        = "Webapp"
        }
      + target_type                        = "ip"
      + vpc_id                             = (sensitive)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/api/v2/health"
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_lb_target_group.clash-bot-ws-tg will be created
  + resource "aws_lb_target_group" "clash-bot-ws-tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "clash-bot-webapp-ws-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "clash-bot-webapp-ws-ecs-tg"
        }
      + tags_all                           = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-ws-ecs-tg"
          + "Type"        = "Webapp"
        }
      + target_type                        = "ip"
      + vpc_id                             = (sensitive)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/ws/health"
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_security_group.clash-bot-webapp-sg will be created
  + resource "aws_security_group" "clash-bot-webapp-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "clash-bot-webapp-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "clash-bot-webapp-alb-sg"
        }
      + tags_all               = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-alb-sg"
          + "Type"        = "Webapp"
        }
      + vpc_id                 = (sensitive)
    }

  # aws_security_group.clash-bot-webapp-task-sg will be created
  + resource "aws_security_group" "clash-bot-webapp-task-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "clash-bot-webapp-ecs-task-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "clash-bot-webapp-ecs-task-sg"
        }
      + tags_all               = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-ecs-task-sg"
          + "Type"        = "Webapp"
        }
      + vpc_id                 = (sensitive)
    }

  # aws_security_group.clash-bot-ws-task-sg will be created
  + resource "aws_security_group" "clash-bot-ws-task-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "clash-bot-webapp-ws-ecs-task-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "clash-bot-webapp-ecs-task-sg"
        }
      + tags_all               = {
          + "Application" = "Clash-Bot-Webapp"
          + "Name"        = "clash-bot-webapp-ecs-task-sg"
          + "Type"        = "Webapp"
        }
      + vpc_id                 = (sensitive)
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs_webapp_service_name        = "clash-bot-webapp-service"
  + ecs_ws_service_name            = "clash-bot-webapp-ws-service"
  + webapp_lb_url                  = (sensitive value)
  + webapp_task_definition_version = (known after apply)
  + ws_task_definition_version     = (known after apply)

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*